cask_args appdir: '/Applications'

tap "caskroom/cask"
tap "homebrew/binary"
tap "homebrew/bundle"
tap "homebrew/core"

brew "ack"
brew "libyaml"
brew "ansible"
brew "awscli"
brew "bash-completion"
brew "docker-machine-driver-xhyve"
brew "emacs"
brew "fish"
brew "ghq"
brew "git"
brew "go"
brew "glide"
brew "gmp"
brew "libpng"
brew "oniguruma"
brew "jq"
brew "kubernetes-cli"
brew "kops"
brew "kubernetes-helm"
brew "mas"
brew "mongodb"
brew "mysql"
brew "nettle"
brew "pcre"
brew "nginx"
brew "nvm"
brew "packer"
brew "parallel"
brew "peco"
brew "pwgen"
brew "redis"
brew "shellcheck"
brew "stoken"
brew "terraform"
brew "vim"
brew "wget"
brew "xz"
brew "the_silver_searcher"
brew "tmux"
brew "tree"

cask "atom"
cask "docker"
case "dropbox"
cask "iterm2"
cask "google-chrome"
cask "minikube"

mas "Be Focused Pro", id: 961632517
mas "Bear", id: 1091189122
mas "CotEditor", id: 1024640650
mas "Dashlane", id: 552383089
mas "Day One", id: 1055511498
mas "Evernote", id: 406056744
mas "Fantastical 2", id: 975937182
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "MindNode", id: 1289197285
mas "Quiver", id: 866773894
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Things3", id: 904280696
mas "Todoist", id: 585829637
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
